# Входът се чете от конзолата и съдържа точно 4 реда:
# 1.	Необходимо количество найлон (в кв.м.) - цяло число в интервала [1... 100]
# 2.	Необходимо количество боя (в литри) - цяло число в интервала [1…100]
# 3.	Количество разредител (в литри) - цяло число в интервала [1…30]
# 4.	Часовете, за които майсторите ще свършат работата - цяло число в интервала [1…9]


# •	Предпазен найлон - 1.50 лв. за кв. метър
# •	Боя - 14.50 лв. за литър
# •	Разредител за боя - 5.00 лв. за литър
# За всеки случай, към необходимите материали, Румен иска да добави още 10% от количеството боя и 2 кв.м. найлон, разбира
# се и 0.40 лв. за торбички. Сумата, която се заплаща на майсторите за 1 час работа, е равна на 30% от сбора на всички разходи за материали.


needed_nylon = int(input())
needed_paint = int(input())
thinner = int(input())
hours = int(input())
bags_price = 0.40

nylon_total = 1.50 * (needed_nylon + 2)
paint_total = (needed_paint + needed_paint * (10 / 100)) * 14.50
thinner_total = thinner * 5
absolute_total = nylon_total + paint_total + thinner_total + bags_price
total_hours = (absolute_total * (30/100)) * hours
price = absolute_total + total_hours
print(price)

