# •	Баскетболни кецове – цената им е 40% по-малка от таксата за една година
# •	Баскетболен екип – цената му е 20% по-евтина от тази на кецовете
# •	Баскетболна топка – цената ѝ е 1 / 4 от цената на баскетболния екип
# •	Баскетболни аксесоари – цената им е 1 / 5 от цената на баскетболната топка

# •	Годишната такса за тренировки по баскетбол – цяло число в интервала [0… 9999]
year_tax = int(input())
shoes = year_tax * (60/100)
clothes = shoes * 0.8
ball = clothes / 4
accesories = ball / 5

total = year_tax + shoes + clothes + ball + accesories
print(total)


